brew "wget"                    # Download files from the web
brew "cmake"                   # Cross-platform build system
brew "fd"                      # Fast alternative to find
brew "fzf"                     # Fuzzy finder for command line
brew "bat"                     # Cat with syntax highlighting
brew "eza"                     # Modern replacement for ls
brew "ripgrep"                 # Fast text search tool
brew "gh"                      # GitHub CLI
brew "git-lfs"                 # Git Large File Storage
brew "dialog"                  # Display dialog boxes from shell scripts
brew "neovim"                  # Modern Vim-based text editor
brew "pkg-config"              # Helper tool for compiling applications
brew "cairo"                   # 2D graphics library
brew "pango"                   # Text layout and rendering library
brew "libpng"                  # PNG image library
brew "jpeg"                    # JPEG image library
brew "giflib"                  # GIF image library
brew "librsvg"                 # SVG rendering library
brew "pixman"                  # Low-level pixel manipulation library
brew "fastfetch"               # System information tool
brew "tmux"                    # Terminal multiplexer
brew "tree"                    # Display directory structure as tree
brew "watch"                   # Execute program periodically
brew "zsh-autosuggestions"     # Fish-like autosuggestions for zsh
brew "nvm"                     # Node Version Manager
brew "glslang"                 # OpenGL/Vulkan shader compiler

brew "act"                     # Run GitHub Actions locally
brew "cloudflared"             # Cloudflare tunnel client
brew "ffmpeg"                  # Video/audio processing tool
brew "lazygit"                 # Terminal UI for git
brew "nginx"                   # HTTP and reverse proxy server
brew "pnpm"                    # Fast, disk space efficient package manager
brew "tree-sitter"             # Parser generator and incremental parsing library
brew "yarn"                    # JavaScript package manager
brew "yt-dlp"                  # Download videos from YouTube and other sites

cask "vlc"                     # Media player
cask "rar"                     # Archive manager

cask "alacritty"               # GPU-accelerated terminal emulator
cask "alt-tab"                 # Windows-style alt-tab for macOS
cask "audacity"                # Audio editing software
cask "bentobox"                # Window tiling/organizer
cask "blackhole-2ch"           # Virtual audio driver (2 channels)
cask "blackhole-16ch"          # Virtual audio driver (16 channels)
cask "blackhole-64ch"          # Virtual audio driver (64 channels)
