brew "wget"
brew "cmake"
brew "fd"
brew "fzf"
brew "bat"
brew "eza"
brew "ripgrep"
brew "gh"
brew "git-lfs"
brew "dialog"
brew "neovim"
brew "pkg-config"
brew "cairo"
brew "pango"
brew "libpng"
brew "jpeg"
brew "giflib"
brew "librsvg"
brew "pixman"
brew "fastfetch"
brew "tmux"
brew "tree"
brew "watch"
brew "zsh-autosuggestions"
brew "nvm"
brew "glslang"

cask "vlc"
cask "rar"
